clc
%原始数据：x1，x2分为两类
x1=[1 1; 2 0; 2 1; 0 2; 1 3;2 2;3 5; -1 3; -2 4; -1 4;];
x2=[-2 2; 0 0; -1 0; -1 -1; 0 -2; -1 -2; -1 1; -2 0; 2 -2; -3 1;];
%求两类数据的类内均值
M1 = mean(x1,1);
M2 = mean(x2,1);
%求两类数据的类内散布矩阵si和总类内散布矩阵sw
s1=0; s2=0;
for i=1:10
s1=s1+(x1(i,:)'-M1')*(x1(i,:)'-M1')';
s2=s2+(x2(i,:)'-M2')*(x2(i,:)'-M2')';
end
sw=s1+s2;
w =inv(sw)*(M1'-M2'); %求出最优方向
kw=w(2)/w(1) %kw是最优方向在二维平面上的投影直线的斜率
bw=0 %该直线斜率
y1=w'*x1';
y2=w'*x2';
y0=[y1,y2];
th=mean(y0); %判别阈值
y=y0-th; %y是经过判别处理后数据的投影值，y>0则判别为第一类，反之判为第二类
bw1 = classify(x1,x2,w,bw);%分类器
%在二维平面上画出原始数据点
plot(x1(:,1),x1(:,2),'ro');
hold on
plot(x2(:,1),x2(:,2),'b*')
hold on
%画出分类分界线
m2=-4:0.01:10;
n2=(-1/kw).*m2+bw1;
p=plot(m2,n2,'b-');
set(p,'LineWidth',2)
hold on;
title('fisher分类器的分类结果')